{
  "title": "Product Design",
  "imageSrc": "https://coaxsoft.com/images/svg/technology/product_design.svg",
  "info": "Product design of web applications plays a key role in the Internet business, transforming laconic forms and original color combinations into effective means of merchandising.",
  "description": "<p>The first thing that any visitor sees is certainly the website design. It creates the initial impression, which the website visitor will have virtually forever. The website for some users is the first and last thing they will associate your company with. That’s exactly why you have to be proud of your website, invest maximum of efforts into it, and remember that it is to be upgraded regularly.</p><p>The web app design allows provision of t and colorful web applications increase the brand appeal, allowing formation of a virtual ecosystem around it and thus increasing its demand.</p> <p>The design development is a complex technological process with its rules and logics, including a plurality of stages. However, at the center of any design there are the original concepts that are realized in the form of specific visual solutions and that serve for the successful implementation of the whole project.</p> <p>The stages and deadlines for implementation of each project depend on the type of the design and nature of the set tasks. In order to best meet the customer’s needs, we make each development stage absolutely transparent. Creating a website design requires careful consideration of every detail. Such a work includes:</p><ul class=\"custom-list is-ordered\"><li><p><span class=\"is-dark has-text-weight-bold\">Preparation</span>You fill in the brief form, we define the business task of the project together, examine, and analyze similar competitive sites.<span class=\"is-dark has-text-weight-bold\">Discussion</span>The process involves not only designers, but also the leader that is leading the project. At this time, original ideas are generated and the structure, colors, usability, and many other things are worked out.</p></li><li><p><span class=\"is-dark has-text-weight-bold\">Model creation.</span>At this stage, it is decided where the main elements of the site will be located and how they will look.A comfortable and user-friendly navigation is also developed here. The result is several design variants.</p></li><li><p><span class=\"is-dark has-text-weight-bold\">Approval</span> Here you assess how the updated appearance of the Internet resource corresponds to the corporate spirit of the company. If necessary, some changes are made.</p></li></ul><p>The unique design is the trademark of any brand. The original visual solutions enhance brand awareness and stimulate buying activity. The popularity of the web resources with an impressive and stylish design is significantly higher than of the sites with a standard design. </p> <p>Would you like to get an original, memorable, and colorful design that outlines your product against the background of the competitors’ offers? Our designers are ready to help you. We do not produce template designs, but select a set of unique solutions for each individual project, taking into account the distinctiveness of the brand and its benefits. </p>",
  "categoryItems": [
    {
      "itemName": "Branding",
      "itemImage": "https://coaxsoft.com/images/svg/technology/product_design/branding.svg"
    },
    {
      "itemName": "Interaction Design",
      "itemImage": "https://coaxsoft.com/images/svg/technology/product_design/interaction_design.svg"
    },
    {
      "itemName": "Ui Design",
      "itemImage": "https://coaxsoft.com/images/svg/technology/product_design/ui_design.svg"
    }
  ]
}

